// 获取游戏名字
function getGameName(id) {
	let name = {
		101: ["10p1sc", "时间墙堆砌,很无聊"],
		102: ["挖矿增量", "真的是挖矿,极速版"],
		202: ["概率统治世界", "尝试和作者勾心斗角"],
		203: ["点击墙", "点击墙的点击墙"],
		501: ["愚人节", "假装这是四月"]
	}[id]

	if (typeof name == 'undefined') name = ['未完成游戏', "这个游戏目前是棍木"]

	return name
}

// 新闻
function getNewsList() {
	return [
		`玩家自定义新闻,不代表开发者立场|${player.global.mynews}`,
		`我不想写新闻了,你自己写:<input
  			type="text"
 			maxlength="50"
 			size="50" 
			placeholder="请输入文本,至多50字符,5秒不输入切换新闻"
			oninput="
				news.completeTime = Date.now()
				player.global.mynews = this.value
			" />`,
		"欢迎来到一千零一树,以下是本游戏的规则怪谈",
		' <img src="resources/bx.gif" width="40px"/>',
		' <img src="resources/ksm.gif" width="60px"/>',
		'有没有发现"饕餮"两个字最下面都是"良"字（良子）',
		'双子塔跟比萨斜塔说"哥们,灵敏度发一下"',
		"为什么黑人很少坐邮轮,因为他们知道吸取教训",
		"喜欢别人怀里的女人是不是和喜欢的女人在别人怀里是一个状态（x）",
		"二次元的钱好赚,所以房子按平方米卖更赚米",
		"在茶百道变成吸百根之前我不会说一句话",
		"恶者……终会作茧自缚……遵循既定的故事,走向结局",
		"在同时遭遇多重指责的情况下,人们总是会下意识的对自己被污蔑最严重的事进行反驳和辩解",
		"我操,用户彻底怒了",
		"一觉醒来我一觉醒来,而我不变",
		"群友就像赛博猎犬,平时不看群,但看到什么好玩的就叼回来,导致经常叼回来两个一模一样的东西",
		"我想变成香香软软可可爱爱的女孩子被大家操",
		"小信球～中不中啊,劲儿小嘞磕搀人,就这一会儿嚷可镇累了?某吃饭吧恁,孬种♡～孬种♡～",
		"对立很有名气,当年光一个人砍她二十多刀都没叫一声的狠人,后面一问才知道第一刀砍到声带了",
		"小学一年级,老师让我们把0到9分成两组,别人都是02468,13579.只有我是23468,01579.因为23468能组成绿一色",
		"天哪这简直就是我",
		"一个孕妇挺着大肚子下楼梯,楼梯边一个鬼躲着准备吓她,突然一只手把鬼拖走暴打了一顿,边打边骂:你把我妈吓流产了,老子怎么投胎?",
		"我要对你倒苦水——死库水!",
		"带假鸡巴去教室被老师赶出来了,委屈的想哭,明明那么多人带真鸡巴进教室也没人管",
		"Qxe1+ Rxe1 Rxe1+ Rxe1 Rxe1#",
		"你知道吗,蟹膏是螃蟹的精液! 是吗我一直很喜欢吃. 真的,对了你要来我家吃蟹膏吗? 你买螃蟹了吗? 我是巨蟹座.",
		"我操.这人怎么看了我一眼?",
		"突击检查:上一条新闻是什么?",
		"怎么感觉感觉到这么多感觉,就像感觉到了感觉一样很多感觉,感觉挺感觉的,就是感觉感觉有点感觉",
		"我曾有个和我母亲同名的女朋友,我们在爱爱的时候我不允许我叫她的名字,因为会让我想起我的女朋友",
		"今天是民国114年5月1日星期4,而且还有19分钟就是19:19:08.10,一生只能转一次",
		"别笑,你也过不了第二关",
		"路易十六不喜欢高斯,因为高斯的兄弟高德总叫他掉头",
		"太好了,是QQ聊天记录,这下不得不信了",
		"别人对你说滚的时候怎么办?就像下棋一样,你要应招,对方对你走了滚这步棋,你就走母,你发一个母,这样对方的攻击全部化为泡影.你赢了",
		"我们都知道,赛马,是马赢.那马术与赛马的区别是什么?答案:马术就是马加骑手赢",
		"胃酸是硫酸还是硝酸? 盐酸. 怎么可能是盐酸?盐酸在我肚子里我不得咸死了吗? 你胃有味觉吗? 都胃觉了,胃怎么可能没有胃觉?",
		"蚁酸是甲酸,但是乙酸居然是醋酸,这不神奇吗?",
		"我发现一件事,女孩子小时候喜欢玩娃娃,男孩子喜欢玩电动玩具,然而长大后女孩子喜欢用电动玩具,男孩子喜欢用娃娃,这大概就是成长吧",
		"宝贝,今天学历史了吗",
		"我昨天让你删除的文件你怎么删了???",
		"为什么地球online能开麦不让聊天框,挠馋游戏!还不给退款. 有的,拼多多可以仅退款.",
		"当时有一男一女两个老玩家直接就把游戏塞我手上了,我都没说要玩,结果游戏退不出来了,只能玩了",
		'媒体:"疫情使俄罗斯倒退了四十年" 普京:"还有这好事"',
		"孩子们,你们其实不用羡慕上海沪爷,因为在你出生之前你是京爷",
		"这个机器人是真人吗",
		"我的肉体是我祖传基因的,我的思想是网上各种梗组成的,我还在努力工作孕育AI,请问我是谁?",
		"洛是谁,必这么达",
		"有什么事情白人能做黑人不能做? Hey Dad.",
		"如果你一直把窗口宽度拉来拉去,新闻就会出bug,我不想修了(已经回退到现在的新闻样式,不再有bug \\^o^/)",
		"时间就是金钱,时间墙就是金山银山",
		"现在有一个概率p,代表每秒获得1点数的概率,有一个刻速度1/d,代表每秒刻速,现在请用p和d计算每刻获得点数的概率",
		"今天像往常一样,把手机塞好等着来消息时振动带来的快感,等了半天以为没人给我发消息,原来是开免打扰了啊哈哈",
		"我吃饱了,浑身是血,我死了,我是蚊子",
		"以后我有钱了,我要让假几把玩斐济北",
		"群主,你卖给我的屁股一点也不爽,我要无效退款",
		"我想,种族歧视真的是会遗传的,这种东西是内化的,有一天,我在路上看到了一个黑人,我下意识抓紧了我的钱包,尽管我知道他不可购买.最后他还是偷走了我的钱包",
		'我今天遇到了一个双眼暗淡的朋友,ta满身疲惫,我记得上次见面还不是这样的来着,于是我本能的伸手想摸摸ta,发现手上传来一阵冰凉,"我摸的好像是镜子".',
		"建议洲孝子都去买个飞机杯,连飞机杯都可以把把出金,你三角洲能把把出金吗",
		"根据野史记载,吴国和魏国在签订契约时为了防止被蜀国偷走,把契约原件藏在了装有五味花生的麻袋里,于是这个契约就变成了五味契约,又叫吴魏契约",
		"我做了一个梦.在梦里,雨水不停的落下,直到淹没一切.淅淅沥沥的雨声从未停止,水,虽然是柔软的东西,但它也能摧毁那些坚硬无比的石头.城市被埋藏在地底,人们祈求着天晴,但雨从未停止",
		"解释笑点就像是解剖青蛙,你可以知道青蛙的内部构造,也会在以后见到类似的青蛙时有一个认识,但这只青蛙会死的透透的",
		"好笑吗?我只看到一位快饿死的魅魔撕不开食品包装",
		"Lap的妈妈有三个儿子,一个叫Nap,一个叫Map,最后一个叫什么?",
		"1+1!=2",
		"专家最新发现:男人有格调",
		"时间墙的存在不是为了阻挡你,而是为了证明你究竟有多渴望背后的世界",
		"猫耳是不能乱摸的哦..啊啊..是你啊!你的话应该没问题的哦",
		"如果你一条命通过了愚人节小游戏,那么你会获得一个成就,但这真的可能吗?",
		"在某处普通的地方,有四个四被放在一个字母后面,这是偶然还是自然对数底?",
		"如果你点了一千次都没办法打破这堵墙,那我堵你堵上我堵了一百年的冠状动脉也破不掉这堵墙",
		"质量越大,引力就会越大,距离越小,引力也会越大,那质量越大,距离就会越小吗?",
		"我们需要另外一位开发者来测试我们的时间流速,快来帮帮我们!",
		"某二游写角色技能是覆盖旧状态,但是不知道为什么写进了账号信息,于是开个技能你的账号就注销了变成新号了,反正不是我们游戏",
		"夸我喵夸我喵夸我喵夸我喵夸我喵夸我喵夸我喵夸我喵夸我喵夸我喵夸我喵夸我喵",
		"占位符占位符占位符占位符占位符占位符占位符占位符占位符占位符占位符占位符",
		"尝试在控制台输入`player._501.trig[5]=true`以获取一个*成就*!"
	]
}

function getSloganList() {
    return [
        `This is a <span style="background: linear-gradient(in hsl longer hue 90deg,
            hsl(-30, 100%, 50%),
            hsl(330, 100%, 50%));
            color: transparent;
            background-clip: text;
            -webkit-background-clip: text;
            ">RAINBOW</span>`,
        "150 bpm for 400000 minutes!",
        "<span class='p1'>我</span><span class='p2'>要</span><span class='p3'>玩</span><span class='p4'>一</span><span class='p5'>千</span><span class='p6'>零</span><span class='p7'>一</span><span class='p8'>树</span><span class='p9'>就现在</span>",
        "EMBRACE the NIGHT!!!",
        "Also try the sleep tree",
        "KiraKira☆DokiDoki",
        "这里没有任意的标语",
        "f(x)=x^x,g(x)=f(f(x))",
        "Mindcraft : Dream Edit",
        "this=1 this'=0 '=0",
        "this=x this'=1 '=1/x",
        "this=x^2 this'=2x '=2/x",
        "this=x^n this'=nx^(n-1) '=n/x",
        "this=x^x this'=x^x(lnx+1) '=1/(lnx+1)",
        "this=∫f(x)dx this'=f(x) '=1/∫dx",
        "∫ dx的结果是多少?",
        "Freedown Dive↓↓↓↓↓",
        "undefined",
        "I feel it in my b*ood",
        "Try to catch me there",
        "哦哈啊啊啦咯嚓嚓吧喏啦",
        "qwertyuiopasdfghjklzxcvbnm",
        "There is O game here",
        "Go to 127.0.0.1:5500",
        "1<sup>2<sup>3<sup>4<sup>5<sup>6<sup>7<sup>8<sup>9</sup></sup></sup></sup></sup></sup></sup></sup>",
        "I fucked 100 people!",
        `<button onclick="playersound('s2')">1</button><button onclick="playersound('s2')">1</button><button onclick="playersound('s2')">4</button><button onclick="playersound('s2')">5</button><button onclick="playersound('s2')">1</button><button onclick="playersound('s2')">4</button>`,
        "v1.797693134862e+308",
        "[Object object]",
        Math.random(),
        randomString(20),
        "1001tree.github.io",
        "гRεε匚③つ≒？",
        "不敢睁开眼,希望是我的幻觉",
        '<img src="resources/bx.gif" />',
        `<button onclick="playersound('g1')">Nothing can beat your 1001tree</button>`,
        () => { return () => false },
        "你看到这句话的频率不再为0!",
        "不要等失去才学会珍惜",
        "We think you’re gonna like it here.",
        "我不想干活 我要写标语",
        "Today is 4.1 right?",
        "God damn why is it so hard?",
        "含1001(2)+2↑↑3个小游戏的游戏",
        "The 1001-Tree Team made this one",
        "A▷∫⊥ГAÇ⊥ ÇΗA○∫A▷イ∫∫",
        "成就藏着秘密!!!",
        "There is some tips in news",
        "你见过凌晨四点的1001树吗?",
        "We have storngest Developers!",
        "9种颜色 9个夜晚!",
        "我们真的在用您的电脑挖矿!",
        "Never gonna let you dive↓",
        "I dedi becosof my dad",
        "your computer is in 90°",
        "CrossSiteScripting"
    ]    
}

var slogan = getSlogan()
